blasius_laminar_github/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0) //point0
    (1 0 0) //point1
    (1 1 0) //point2
    (0 1 0) //point3
    (0 0 0.1) //point4
    (1 0 0.1) //point5
    (1 1 0.1) //point6
    (0 1 0.1) //point7

    //here are our new coordinates
    (6 0 0) //point8
    (6 1 0) //point9
    (6 0 0.1) //point10
    (6 1 0.1) //point11
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 80 1) simpleGrading (0.2 40 1) //first block
    hex (1 8 9 2 5 10 11 6) (100 80 1) simpleGrading (6 40 1)//second block
);

edges
(
);

boundary
(
    zeroGradientPlanes
    {
        type patch;
        faces
        (
           (1 5 4 0) //this is the bottom left side (x=0,1 y=0) 
	   (8 9 11 10) //this is outlet (x=2 plane)
           (3 7 6 2) //this is x=0 and x=1 (top y plane y=1)
	   (2 6 11 9) //this is x=1 and x=2 (top y plane y=1)
	);
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3) //this is x=0            
	);
    }
    
    plate
    {
        type patch;
        faces
        (
            (1 8 10 5) //this is the the wall where y=0, x=1 and x=2            
        );
    }

    frontAndBack
    {
        type empty; //this is for a 2D case
        faces
        (
            (0 3 2 1) //z=0 (low z plane), x=0 or 1
            (4 5 6 7) //z=0.1 (high z plane), x=1 or 1
	    (1 2 9 8) //z=0 (low z plane), x=1 or 2
	    (5 10 11 6) //z=0.1 (high z plane), x=1 or 2
        );
    }
);


// ************************************************************************* //
